'''
3. Посчитаем количество наименований продуктов, которые нужно сегодня купить.
Создайте список, содержащий названия продуктов.
Объявите переменную count и посчитайте в ней количество продуктов
Выведите на экран сообщение в формате:
У тебя {количество} продуктов, где {количество} — значение переменной count.
'''

s = ['хлеб', 'кефир', 'сыр', 'печенье', 'колбаса', 'молоко', 'сок']
count = len(s)
print("У тебя " + str(count) + " продуктов, где " + str(count) + " - значение переменной count." )